---
kind: other
id: Methods.T:Autodesk.Revit.DB.InstanceBinding
source: html/ed02a88a-a9df-5ebc-3069-1555d9e06abe.htm
---
# InstanceBinding Methods

Causes the object to release immediately any resources it may be utilizing.